tap "homebrew/services"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Ruby environment tool
brew "chruby"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Library for command-line editing
brew "readline"
# Portable Foreign Function Interface library
brew "libffi"
# Implementation of the file(1) command
brew "libmagic"
# YAML Parser
brew "libyaml"
# LLM inference in C/C++
brew "llama.cpp"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Persistent key-value database, with built-in net interface
brew "redis"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Unsupervised text tokenizer and detokenizer
brew "sentencepiece"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Audio utility
cask "background-music"
# Free and open-source web browser
cask "chromium"
cask "font-dejavu"
cask "font-liberation"
# Full TeX Live distribution with GUI applications
cask "mactex"
vscode "aaron-bond.better-comments"
vscode "abalejr.forest-focus"
vscode "akamud.vscode-theme-onedark"
vscode "brittanychiang.halcyon-vscode"
vscode "connor4312.esbuild-problem-matchers"
vscode "cs50.ddb50"
vscode "cstrap.python-snippets"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "feb19.theme-forest"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "grapecity.gc-excelviewer"
vscode "hassanoof.theme"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-csv-syntax"
vscode "johnpapa.winteriscoming"
vscode "katsute.code-background"
vscode "kevinrose.vsc-python-indent"
vscode "kocean33.vesper-extended"
vscode "luxcium.pop-n-lock-theme-vscode"
vscode "luxcium.pop-n-lock-theme-vscode-rajin"
vscode "mak626.one-dark-vscode-theme"
vscode "mariorodeghiero.vue-theme"
vscode "mateocerquetella.xcode-12-theme"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.theme-materialkit"
vscode "paperfolding.vscode-background-cover-lite"
vscode "pbkit.vscode-pbkit"
vscode "peterj.proto"
vscode "pkief.material-icon-theme"
vscode "properup.vscode--theme"
vscode "rangav.vscode-thunder-client"
vscode "raunofreiberg.vesper"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "saptarshidey.latex-viewer"
vscode "sdras.fortnite-vscode-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "solarliner.linux-themes"
vscode "thebarkman.vscode-djaneiro"
vscode "tomoki1207.pdf"
vscode "torn4dom4n.latex-support"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
